---
kind: property
id: P:Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs.ElementTypeId
source: html/ef0229e3-2e15-2b36-538e-487b8b136a2d.htm
---
# Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs.ElementTypeId Property

The id of the ElementType to be duplicated.

## Syntax (C#)
```csharp
public ElementId ElementTypeId { get; }
```